Семинар 6 Домашняя работа

# Задача 30:  Заполните массив элементами арифметической прогрессии. 
# Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. 
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

# el = int(input("Введите первый элемент: "))
# step = int(input("Введите шаг: "))
# len_el = int(input("Введите длину массива: "))
# el_pr = []

# for i in range(len_el):
#     el_pr.append(el + (i) * step)
# print(el_pr)

# Задача 32: Определить индексы элементов массива (списка), 
# значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)
# import random

# mas = []
# for i in range(10):
#     mas.append(random.randint(0,10))
# print(mas)

# a = int(input('Диапазон от: '))
# b = int(input('до: '))
    
# for i in range(len(mas)):
#     if a <= mas[i] <= b:
#         print(i)



